Tekla.Structures.Drawing.AnnotationDrawing
The Annotation drawing class is for handling annotation drawings in Tekla Structures.

Tekla.Structures.Drawing.AnnotationDrawing.#ctor
Instantiates a new Annotation drawing using standard attributes.

Tekla.Structures.Drawing.AnnotationDrawing.#ctor(System.Boolean)
Instantiates new Annotation drawing.
LoadAttributefile: used internally for selection for performance reasons

Tekla.Structures.Drawing.AnnotationDrawing.Modify
Applies the changes made to the drawing attributes.
Tekla.Structures.Drawing.DrawingHandler
Returns: True on success.

Tekla.Structures.Drawing.AnnotationDrawing.Select
Selects the drawing.
Returns: True on success.

Tekla.Structures.Drawing.AnnotationDrawing.Insert
Inserts an empty annotation arrangement drawing. Views must be added separately.
A drawing can be inserted only when there is no active drawing.
Returns: True on success.
Throws Tekla.Structures.Drawing.CannotInsertDrawingException: Thrown if inserting a drawing when another drawing is active.